{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 10\n",
      "1 10 9 8 7 6 5 4 3 2\n",
      "4 1 10 9 8 7 6 5 3 2\n"
     ]
    }
   ],
   "source": [
    "import heapq\n",
    "\n",
    "class RankingSystem:\n",
    "    def __init__(self, num_features, feature_weights, objects_features):\n",
    "        # Инициализация системы ранжирования с количеством признаков, весами признаков и признаками объектов\n",
    "        self.num_features = num_features\n",
    "        self.feature_weights = feature_weights\n",
    "        self.objects_features = objects_features\n",
    "        # Вычисление начальных значений релевантности для всех объектов\n",
    "        self.relevance_scores = [self.calculate_relevance(object_idx) for object_idx in range(len(objects_features))]\n",
    "\n",
    "    def calculate_relevance(self, object_idx):\n",
    "        # Вычисление значения релевантности объекта на основе взвешенной суммы его признаков\n",
    "        return sum(self.feature_weights[feature_idx] * self.objects_features[object_idx][feature_idx] for \n",
    "                   feature_idx in range(self.num_features))\n",
    "\n",
    "    def update_feature(self, object_idx, feature_idx, new_value):\n",
    "        # Обновление конкретного признака объекта и пересчет его релевантности\n",
    "        self.objects_features[object_idx][feature_idx] = new_value\n",
    "        self.relevance_scores[object_idx] = self.calculate_relevance(object_idx)\n",
    "\n",
    "    def get_top_k(self, k):\n",
    "        # Получение индексов топ k объектов с наибольшими значениями релевантности\n",
    "        sorted_indices = sorted(range(len(self.relevance_scores)), key=lambda idx: self.relevance_scores[idx], reverse=True)\n",
    "        return [idx + 1 for idx in sorted_indices[:k]]\n",
    "\n",
    "def main():\n",
    "    # Входные данные\n",
    "    num_features = 2\n",
    "    feature_weights = [1, 100]\n",
    "    num_objects = 10\n",
    "    objects_features = [\n",
    "        [1, 2],\n",
    "        [2, 1],\n",
    "        [3, 1],\n",
    "        [4, 1],\n",
    "        [5, 1],\n",
    "        [6, 1],\n",
    "        [7, 1],\n",
    "        [8, 1],\n",
    "        [9, 1],\n",
    "        [10, 1]\n",
    "    ]\n",
    "    num_queries = 4\n",
    "    queries = [\n",
    "        \"1 2\",\n",
    "        \"1 10\",\n",
    "        \"2 4 1 1000\",\n",
    "        \"1 10\"\n",
    "    ]\n",
    "\n",
    "    # Инициализация системы ранжирования\n",
    "    ranking_system = RankingSystem(num_features, feature_weights, objects_features)\n",
    "\n",
    "    # Обработка запросов\n",
    "    results = []\n",
    "    for query in queries:\n",
    "        query_parts = list(map(int, query.split()))\n",
    "        if query_parts[0] == 1:\n",
    "            # Запрос типа 1: получить топ k релевантных объектов\n",
    "            top_k = query_parts[1]\n",
    "            results.append(\" \".join(map(str, ranking_system.get_top_k(top_k))))\n",
    "        elif query_parts[0] == 2:\n",
    "            # Запрос типа 2: обновить значение признака\n",
    "            object_idx, feature_idx, new_value = query_parts[1] - 1, query_parts[2] - 1, query_parts[3]\n",
    "            ranking_system.update_feature(object_idx, feature_idx, new_value)\n",
    "\n",
    "    # Печать результатов\n",
    "    for result in results:\n",
    "        print(result)\n",
    "\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()\n",
    "\n",
    "# Объяснение кода\n",
    "# Класс RankingSystem используется для управления объектами и\n",
    "# вычисления их значений релевантности на основе заданных признаков и весов.\n",
    "# Релевантность объекта вычисляется как взвешенная сумма его признаков.\n",
    "# Класс предоставляет методы для обновления признаков объекта и получения топ k объектов по релевантности.\n",
    "\n",
    "# Анализ эффективности\n",
    "# - Инициализация: Конструктор вычисляет начальные значения релевантности для всех объектов, \n",
    "# что занимает O(d * n) времени, где d — количество объектов, а n — количество признаков на объект.\n",
    "# - Запрос типа 1 (Получение топ k): Метод get_top_k использует `heapq.nlargest` для нахождения топ k релевантных объектов, \n",
    "# что имеет сложность O(d log k), где d — количество объектов.\n",
    "# - Запрос типа 2 (Обновление признака): Обновление признака включает пересчет значения релевантности для указанного объекта, \n",
    "# что занимает O(n) времени, где n — количество признаков на объект.\n",
    "# - Пространственная сложность: Пространственная сложность составляет O(d * n) из-за хранения признаков\n",
    "# и значений релевантности для всех объектов.\n",
    "\n",
    "# С точки зрения эффективности, использование кучи (`heapq.nlargest`) для получения топ k объектов обеспечивает относительно быструю обработку запроса\n",
    "# для наиболее релевантных объектов, особенно когда k значительно меньше d. \n",
    "# Однако, если обновления признаков происходят часто, пересчет значений релевантности может стать узким местом. \n",
    "# Потенциальной оптимизацией может быть использование структур данных, которые позволяют \n",
    "# быстрее выполнять обновления и запросы, таких как сбалансированные деревья поиска или отрезковые деревья, в\n",
    "# зависимости от конкретных требований задачи.\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
